SALE LVL3 USING TOKEN Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{MerchantID}}</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{TransactionSecurityKey}}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-{{Version}}">
       <merchantID>{{MerchantID}}</merchantID>
      <merchantReferenceCode>{{$timestamp}}</merchantReferenceCode>
	   <invoiceHeader>
	      <userPO>4119480</userPO>
	   </invoiceHeader>
	   <shipFrom>
	      <postalCode>42651</postalCode>
	   </shipFrom>
	   <item id="0">
	      <unitPrice>59.95</unitPrice>
	      <quantity>10</quantity>
	      <productName>File Cabinet</productName>
	      <taxAmount>49.46</taxAmount>
	      <unitOfMeasure>each</unitOfMeasure>
	      <taxRate>0.0825</taxRate>
	      <totalAmount>648.96</totalAmount>
	      <grossNetIndicator>Y</grossNetIndicator>
	   </item>
	   <item id="1">
	      <unitPrice>4.99</unitPrice>
	      <quantity>50</quantity>
	      <productName>File Folders</productName>
	      <taxAmount>20.58</taxAmount>
	      <unitOfMeasure>each</unitOfMeasure>
	      <taxRate>0.0825</taxRate>
	      <totalAmount>270.08</totalAmount>
	      <grossNetIndicator>Y</grossNetIndicator>
	   </item>
	   <purchaseTotals>
	      <currency>USD</currency>
	      <grandTotalAmount>919.04</grandTotalAmount>
	   </purchaseTotals>
	   <ccCaptureService run="true">
	      <purchasingLevel>3</purchasingLevel>
	   </ccCaptureService>
	   <subsequentAuthID>{{Network Transaction ID from Original Auth Response}}</subsequentAuthID>
	</requestMessage>
  </soapenv:Body>
</soapenv:Envelope>